# Brew File

# Sources {{{
tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/php"
tap "homebrew/services"
tap "homebrew/versions"
tap "neovim/neovim"
# }}}

# Application {{{
brew "tmux"
brew "vim"
brew "neovim"
# }}}

# Environemnt Manager {{{
brew "nvm"        # Node Versions Manager
brew "pyenv"      # Python versions manager
brew "rbenv"      # Ruby versions manager
brew "ruby-build" # Compile and install Ruby
brew "phpbrew"    # PHP versions manager
# }}}

# Networking {{{
brew "stormssh" # SSH Manager
brew "httpie"   # HTTP CLI Client
brew "sshrc"    # Bring SSH config
# }}}

# CLI Utilities {{{
brew "thefuck"             # Wtf?
brew "the_silver_searcher" # Ag
brew "desk"                # Workspace manager
# }}}

# Default libs {{{
brew "automake"
brew "autoconf"
brew "curl"
brew "pcre"
brew "bison"
brew "re2c"
brew "mhash"
brew "libtool"
brew "icu4c"
brew "gettext"
brew "jpeg"
brew "openssl"
brew "libxml2"
brew "mcrypt"
brew "gmp"
brew "libevent"
brew "imagemagick"
# }}}

# Zsh {{{
# }}}

# Cask {{{
cask "iterm2"
# }}}

# vim:foldmethod=marker:foldlevel=0