# Sources
tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/php"
tap "homebrew/services"
tap "homebrew/versions"
tap "neovim/neovim"
tap "homebrew/cask-fonts"

# CLI Tools
brew "curl"
brew "fzf"
brew "htop"
brew "hub"
brew "jq"
brew "neovim"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "shellcheck"
brew "starship"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "wget"
brew "zplug"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"


# Environments
brew "deno"
brew "go"
brew "node"
brew "php"
brew "python"
brew "ruby"
brew "rust"

# Dev Tools
brew "git"
brew "git-extras" # GIT utilities
brew "yarn"       # Dependency management

# Networking
brew "httpie"   # HTTP CLI Client
brew "sshrc"    # Bring SSH config
brew "stormssh" # SSH Manager

# Default libs
brew "autoconf"
brew "automake"
brew "bison"
brew "curl"
brew "gettext"
brew "gmp"
brew "icu4c"
brew "imagemagick"
brew "jpeg"
brew "libevent"
brew "libtool"
brew "libxml2"
brew "mcrypt"
brew "mhash"
brew "openssl"
brew "pcre"
brew "re2c"
brew "zlib"

# GUI Apps
cask "bitwarden"
cask "docker"
cask "google-chrome"
cask "iterm2"
cask "maccy"
cask "obsidian"
cask "postman"
cask "raycast"
cask "rectangle"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "whatsapp"
cask "zoom"

# Fonts
cask "font-hack-nerd-font"
